Revit 2023 API
FilledRegionType.BackgroundPatternId Property
 The background fill pattern Id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2019
Syntax
C#
public ElementId BackgroundPatternId { get; set; }
Visual Basic
Public Property BackgroundPatternId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ BackgroundPatternId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The FillPattern used for a background pattern must have a 'Drafting' target.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The element id must represent a valid FillPatternElement. -or- When setting this property: The FillPattern target must be a drafting pattern.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
FilledRegionType Class
Autodesk.Revit.DB Namespace